//-----------------------------------------------------------------------------
//	Класс для работы с данными Mp3 файлов
//	Копонент звукового двигателя Argentum
//	разработчик : Гилязетдинов Марат
//-----------------------------------------------------------------------------

#ifndef _WMA_FILE_H_INCLUDED_
#define _WMA_FILE_H_INCLUDED_

#include <windows.h>
#include "AbstractSoundFile.h"

class CAbstractSoundFile;
//-----------------------------------------------------------------------------
// Класс для работы с данными Mp3 файлов
//-----------------------------------------------------------------------------
class CWmaFile : public CAbstractSoundFile {
public:
	// конструктор/деструктор
	CWmaFile(CReader* reader_ptr);
	~CWmaFile();

	// получение указателя на формат данных
	WAVEFORMATEX* GetFmt(void)
	{
		return 0;
	}
};

#endif