//-----------------------------------------------------------------------------
// Работа с ZOOMFX расширением
// Компонент звукового двигателя "Шквал"
// команда     : AntiTank
// разработчик : Гилязетдинов Марат (Марыч)
//-----------------------------------------------------------------------------
#ifndef _ZOOMFX_H_INCLUDED_
#define _ZOOMFX_H_INCLUDED_

// включения
#include <dsound.h>

////////////////////////////////////////////////
// Рабочие методы
////////////////////////////////////////////////
int   zoomfx_TestSupport(                          // проверка наличия поддержки
      LPDIRECTSOUND direct);

int   zoomfx_Set(                                  // установка параметров
      LPKSPROPERTYSET KsPropSet,
      void* data);

int   zoomfx_Get(                                  // получение параметров
      LPKSPROPERTYSET KsPropSet,
      void* data);
#endif